frontend/controllers/MdpController.php

    public function actionCreate()
    {
        $model = new Mdp();
        $user = Yii::$app->user->identity;
        $user_id = $user['id'];
        $model->user_id = $user_id;
        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `mdp` (`user_id`, `mot_de_passe`, `description`, `date_execution`, `adresse_site`) VALUES (3, 'gdfgdfgdfgdfgdfg', 'ceci est une description', '25/06/2021 09:00:00', 'facebook.com')

    protected function findModel($id)
    {
        if (($model = Mdp::findOne($id)) !== null) {
---
SELECT * FROM `mdp` WHERE `id`='8'