frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `access_token`, `status`, `created_at`, `updated_at`) VALUES ('eddy', 'eddy@epsi.fr', '$2y$13$F0GFpjefFdNS.pMM.yF9oeuK3Ak/9x8q6wnKyns8eVh6QzNBa/PWi', 'IvTkp28efLAfLtUtU3KTHhbE-4eNFypp', '5i9NFopID9nl_85ToO8jzt3_1MA30hiJ_1624603724', '-5TeRpR_hN7EgxNVw3GYaNpIxzXrTN-M', 10, 1624603724, 1624603724)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        $user->generateAccessToken();
        return $user->save() && $this->sendEmail($user);